How do I select specific columns from a DataFrame?

使用方括号的形式，用columns的名字就可以获取到

怎么样从DataFrame中过滤出特定的行？

In [2]:
import pandas as pd

In [4]:
titanic = pd.read_csv("/home/liangjiaxing/project/pandas_learn/data/titanic.csv")

# dataframe 和 series 都有这个shape属性
# A pandas Series is 1-dimensional and only the number of rows is returned.
titanic["Age"].shape

(891, 12)

In [7]:
# 获取titanic 的多个子项
# To select multiple columns, use a list of column names within the selection brackets [].
age_sex = titanic[["Age", "Sex"]]
# type(age_sex)
# age_sex.head()
# age_sex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     714 non-null    float64
 1   Sex     891 non-null    object
dtypes: float64(1), object(1)
memory usage: 14.0+ KB

In [15]:
# 怎么样从DataFrame 中过滤特定的行
# 其中 条件表达式的输出实际上是一个pandas 的Series，并且这个Series中的值都是表达式返回的布尔值，数量与 row一致

above_35 = titanic[titanic["Age"] < 40]
above_35.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [21]:
# isin 函数，类似与sql中的in函数，从给定的值中选择
# class_23 = titanic[titanic["Pclass"].isin([1])]
# 如果要使用或 | 操作，那么每个表达式都需要用小括号包起来，否则会报错，此外 or 要用 | 代替， and 要用 & 代替
class_23 = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)]

class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [24]:
# 筛选出非空的值
class_age_notna = titanic[(titanic["Age"].notna()) & (titanic["Age"] > 30)]

class_age_notna.shape

(714, 12)

In [ ]:
# When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.
# 当你使用loc进行筛选，逗号前面的表示你想筛选的行，逗号后面的表示你想筛选的列
adult_names = titanic.loc[titanic["Age"] > 35, "Name"]